/*
************************************************************************
*                北京邮电大学 K60 学习例程
* 文件名 :[global.c]
* 描  述 ：全局变量
* 设计改进：Wei Li
* Email ：378987349@qq.com
* 说  明 ：定义所用的全局变量
***********************************************************************
*/
#include "global.h"
/*----------------------/
*-------速度部分-------/
*---------------------*/
int     speed_pwm = 0;
s16     trueSpeedSigma = 0;     //编码器所读到的脉冲数
int     target_speed;           //目标速度，单位是编码其脉冲数
s16     sp_err = 0;
s16     sp_err1 = 0;            //上次
s16     sp_err2 =0;             //上上次
u16     P_motor =300;
u16     I_motor = 0;
u16     D_motor =20;
/*----------------------/
*-------方向部分-------/
*---------------------*/
u16     P_steer=15;             //舵机P
u16     D_steer =6;             //舵机D
s16     st_ek=0, st_ek1=0;      //当次、上次偏差
int     cur_steer;              //舵机输出PWM值

/*----------------------/
*-------图像部分-------/
*---------------------*/
uint8 Picbuff[CAMERA_SIZE]={0};//解压前缓冲区
uint8 img_origin[CAMERA_H][CAMERA_W];//解压后未进行矫正的
uint8 img[CAMERA_H][CAMERA_W];//梯形校正后用于处理的数组
